In [23]:
import pandas as pd

I believe most of the time people use this package, they should import it like this?

In [24]:
df = pd.DataFrame(
    {
        "Name": ["potato", "tomato", "watermelon"],
        "Age": [2, 3, 4],
        "Sex": ["None", "None", "None"],
    }
)

In [25]:
print(df, df["Name"][2], df["Age"][1], sep = '\n')
print("This is an example of pandas series.")
print(df["Age"])

         Name  Age   Sex
0      potato    2  None
1      tomato    3  None
2  watermelon    4  None
watermelon
3
This is an example of pandas series.
0    2
1    3
2    4
Name: Age, dtype: int64

In [26]:
print(df.describe())

       Age
count  3.0
mean   3.0
std    1.0
min    2.0
25%    2.5
50%    3.0
75%    3.5
max    4.0

In [27]:
titanic = pd.read_csv('titanic.csv')

Reading the contents of the file "titanic.csv" with pandas, the data will be returned as a pandas DataFrame. Head is a function that returns the first n columns of the DataFrame while tail is doing the opposite. DataFrame.dtypes is a list of the representation of the data in each column. TO access to the specific subset column in the DataFrame, use a list of columns in the DataFrame(?). Remember that the DataFrame has the same operations as the numpy array, so we can do many things with it.

In [28]:
print(type(titanic), titanic, titanic.head(8), titanic.tail(8), sep = '\n')

<class 'pandas.core.frame.DataFrame'>
     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
     PassengerId  Survived  Pclass                                      Name  \
883          884         0       2             Banfield, Mr. Frederick James
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket    Fare Cabin Embarked
883    male  28.0      0      0  C.A./SOTON 34068  10.500   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.050   NaN        S
885  female  39.0      0      5            382652  29.125   NaN        Q
886    male  27.0      0      0            211536  13.000   NaN        S
887  female  19.0      0      0            112053  30.000   B42        S
888  female   NaN      1      2        W./C. 6607  23.450   NaN        S
889    male  26.0      0      0            111369  30.000  C148        C
890    male  32.0      0      0            370376   7.750   NaN        Q

In [29]:
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [30]:
ages = titanic["Age"]
print(ages.shape)
age_sex = titanic[["Age", "Sex"]]
print(age_sex.shape)
print(age_sex)

(891,)
(891, 2)
      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [34]:
above_35 = titanic[titanic["Age"] > 35]
print(above_35.head())
print(type(above_35), above_35.shape, )

    PassengerId  Survived  Pclass  \
1             2         1       1
6             7         0       1
11           12         1       1
13           14         0       3
15           16         1       2

                                                 Name     Sex   Age  SibSp  \
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
6                             McCarthy, Mr. Timothy J    male  54.0      0
11                           Bonnell, Miss. Elizabeth  female  58.0      0
13                        Andersson, Mr. Anders Johan    male  39.0      1
15                   Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0

    Parch    Ticket     Fare Cabin Embarked
1       0  PC 17599  71.2833   C85        C
6       0     17463  51.8625   E46        S
11      0    113783  26.5500  C103        S
13      5    347082  31.2750   NaN        S
15      0    248706  16.0000   NaN        S
<class 'pandas.core.frame.DataFrame'>

Writing the current DataFrame to an excel file. A new xlsx file will be created after running the following cell.

We can also use & and | to use multiple conditions. Another way to access to a specific subsets of rows and columns is to use the iloc method.

In [36]:
print(titanic.iloc[9:25, 2:5])

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                    Sandstrom, Miss. Marguerite Rut  female
11       1                           Bonnell, Miss. Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                               Rice, Master. Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                        McGowan, Miss. Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                      Palsson, Miss. Torborg Danira  female

In [31]:
titanic.to_excel("titanic.xlsx", sheet_name = "passengers", index = False)

Dealing with excel files. DataFreame.info() returns the technical information of the files.

In [32]:
titanic = pd.read_excel('titanic.xlsx', sheet_name = 'passengers')
print(titanic.head())
print(titanic.info())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

Try some more operations with the DataFrame.

In [37]:
air_quality = pd.read_csv("air_quality_no2.csv", index_col=0, parse_dates=True)
print(air_quality.head())

                     station_antwerp  station_paris  station_london
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

In [38]:
air_quality["ratio_paris_antwerp"] = (
    air_quality["station_paris"] / air_quality["station_antwerp"]
)
print(air_quality.head())

                     station_antwerp  station_paris  station_london  \
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

                     ratio_paris_antwerp
datetime
2019-05-07 02:00:00                  NaN
2019-05-07 03:00:00             0.495050
2019-05-07 04:00:00             0.615556
2019-05-07 05:00:00                  NaN
2019-05-07 06:00:00                  NaN

In [39]:
air_quality_renamed = air_quality.rename(
    columns = {
        "station_antwerp": "BETR801",
        "station_paris": "FR04014",
        "station_london": "London Westminster",
    }
)
print(air_quality_renamed.head())

                     BETR801  FR04014  London Westminster  ratio_paris_antwerp
datetime
2019-05-07 02:00:00      NaN      NaN                23.0                  NaN
2019-05-07 03:00:00     50.5     25.0                19.0             0.495050
2019-05-07 04:00:00     45.0     27.7                19.0             0.615556
2019-05-07 05:00:00      NaN     50.4                16.0                  NaN
2019-05-07 06:00:00      NaN     61.9                 NaN                  NaN

In [40]:
air_quality_renamed = air_quality_renamed.rename(columns=str.lower)
print(air_quality_renamed.head())

                     betr801  fr04014  london westminster  ratio_paris_antwerp
datetime
2019-05-07 02:00:00      NaN      NaN                23.0                  NaN
2019-05-07 03:00:00     50.5     25.0                19.0             0.495050
2019-05-07 04:00:00     45.0     27.7                19.0             0.615556
2019-05-07 05:00:00      NaN     50.4                16.0                  NaN
2019-05-07 06:00:00      NaN     61.9                 NaN                  NaN